app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
    def index
        render json: {status: 200, songs: Song.all}

SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def show
        p params
        song = Song.find(params[:id])